Revit 2027 API
PhotometricWebLightDistribution(PhotometricWebLightDistribution) Constructor
 Creates a copy of the given photometric web light distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PhotometricWebLightDistribution(
	PhotometricWebLightDistribution other
)
Public Sub New (
	other As PhotometricWebLightDistribution
)
public:
PhotometricWebLightDistribution(
	PhotometricWebLightDistribution^ other
)
new :
        other : PhotometricWebLightDistribution -> PhotometricWebLightDistribution
Parameters
other PhotometricWebLightDistribution
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PhotometricWebLightDistribution Class
PhotometricWebLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace